# Python Phase - Sales Person

This code will be the skeleton part for our Construc Week Project Approach. This file consists of all the major part of the analysis takes place and finally, connecting MySQL databases for it to import all the files and therefore creating a final dashboard. 

For the following phase, we have a total number of 7 datasets in which all of them are unclean meaning, they are not aligned and have a clustered set of results. In order to get ahead of it, each particular dataset has been arranged to ensure the data has been assigned to their particular columns. 

We shall now begin the basic EDA (Exploratory Data Analysis) and ensure each dataset has been cleaned and is set to be used in creating a database and then the dashboard.

In [21]:
# Importing all the essential libraries for the analysis to be done.
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

# Importing libraries to connect and inject all the values from the dataset into the database server.
from sqlalchemy import create_engine
import mysql.connector

In [22]:
# Creating a connector so that the server can be connected here.
db_connector = mysql.connector.connect(
    host = "127.0.0.1",       
    username = "root",
    password = "MySQL12345",
    database = "patternseekers"
)

# A custom message that displays if the operation has been successful.
print(f"You have successfully connected to your database.")

You have successfully connected to your database.

In [23]:
# This engine will be another verification so that all the records made here can be added into the database.
engine = create_engine(f"mysql+mysqlconnector://{"root"}:{"MySQL12345"}@{"127.0.0.1"}/{"patternseekers"}")
print("The connection to the MySQL Engine is now functional.")

The connection to the MySQL Engine is now functional.

In [2]:
# Importing the dataset from its diretory path.
salesperson_df = pd.read_csv('Salesperson [FIXED].csv')

# Displaying the dataset.
salesperson_df

,EmployeeKey,EmployeeID,Salesperson,Title,UPN
0,272,502097814,Stephen Jiang,North American Sales Manager,stephen-jiang@adventureworks.com
1,277,112432117,Brian Welcker,Director of Sales,brian-welcker@adventureworks.com
2,281,841560125,Michael Blythe,Sales Representative,michael-blythe@adventureworks.com
3,282,191644724,Linda Mitchell,Sales Representative,linda-mitchell@adventureworks.com
4,283,615389812,Jillian Carson,Sales Representative,jillian-carson@adventureworks.com
5,284,234474252,Garrett Vargas,Sales Representative,garrett-vargas@adventureworks.com
6,285,716374314,Tsvi Reiter,Sales Representative,tsvi-reiter@adventureworks.com
7,286,61161660,Pamela Ansman-Wolfe,Sales Representative,pamela-ansman-wolfe@adventureworks.com
8,287,139397894,Shu Ito,Sales Representative,shu-ito@adventureworks.com
9,288,399771412,José Saraiva,Sales Representative,jose-saraiva@adventureworks.com
10,289,987554265,David Campbell,Sales Representative,david-campbell@adventureworks.com
11,290,982310417,Amy Alberts,European Sales Manager,amy-alberts@adventureworks.com
12,291,668991357,Jae Pak,Sales Representative,jae-pak@adventureworks.com
13,292,134219713,Ranjit Varkey Chudukatil,Sales Representative,ranjit-varkey-chudukatil@adventureworks.com
14,293,90836195,Tete Mensa-Annan,Sales Representative,tete-mensa-annan@adventureworks.com
15,294,481044938,Syed Abbas,Pacific Sales Manager,syed-abbas@adventureworks.com
16,295,954276278,Rachel Valdez,Sales Representative,rachel-valdez@adventureworks.com
17,296,758596752,Lynn Tsoflias,Sales Representative,lynn-tsoflias@adventureworks.com

In [4]:
# Displaying basic information based on the dataset we have.
salesperson_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   EmployeeKey  18 non-null     int64
 1   EmployeeID   18 non-null     int64
 2   Salesperson  18 non-null     object
 3   Title        18 non-null     object
 4   UPN          18 non-null     object
dtypes: int64(2), object(3)
memory usage: 852.0+ bytes

In [5]:
# Looking for NULL values if they are available in the dataset.
salesperson_df.isnull().sum()

EmployeeKey    0
EmployeeID     0
Salesperson    0
Title          0
UPN            0
dtype: int64

In [6]:
# Searching for duplicate values in the dataset (if exists).
salesperson_df.duplicated().sum()

np.int64(0)

In [7]:
# Identifying the data types to see what we will be dealing with.
salesperson_df.dtypes

EmployeeKey     int64
EmployeeID      int64
Salesperson    object
Title          object
UPN            object
dtype: object

In [8]:
# Removing any leading or trailing whitespace that contain unintended spaces. 
salesperson_df['Salesperson'] = salesperson_df['Salesperson'].str.strip()
salesperson_df['Title'] = salesperson_df['Title'].str.strip()
salesperson_df['UPN'] = salesperson_df['UPN'].str.strip()

In [9]:
# Checking the dataset if it contains any emails that are duplicated.
salesperson_df['UPN'].duplicated().sum()

np.int64(0)

In [12]:
# Checking out the summary of the following dataset in terms of statistics.
salesperson_df.describe(include = 'all')

,EmployeeKey,EmployeeID,Salesperson,Title,UPN
count,18.000000,1.800000e+01,18,18,18
unique,NaN,NaN,18,5,18
top,NaN,NaN,Stephen Jiang,Sales Representative,stephen-jiang@adventureworks.com
freq,NaN,NaN,1,14,1
mean,286.944444,4.928963e+08,NaN,NaN,NaN
std,6.421217,3.341403e+08,NaN,NaN,NaN
min,272.000000,6.116166e+07,NaN,NaN,NaN
25%,283.250000,1.524596e+08,NaN,NaN,NaN
50%,287.500000,4.915714e+08,NaN,NaN,NaN
75%,291.750000,7.480411e+08,NaN,NaN,NaN
max,296.000000,9.875543e+08,NaN,NaN,NaN

In [24]:
# Pushing all the data into the MySQL database.
salesperson_df.to_sql(
    name = 'SalesPerson',
    con=engine,
    index = False,
    if_exists = 'append'
)

# Custom message to ensure the operation has been completed successfully.
print("Table 'SalesPerson' has been created and data has been inserted successfully.")

Table 'SalesPerson' has been created and data has been inserted successfully.

C:\Users\hamad\AppData\Local\Temp\ipykernel_19028\2676303775.py:2: UserWarning: The provided table name 'SalesPerson' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  salesperson_df.to_sql(